driver-tests/bpelse/assign/AssignJbi/src/jbiServiceUnits/AssignBpel/simpleExpression/varInExpr.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="varInExpr" targetNamespace="http://j2ee.netbeans.org/wsdl/testExternalRef/varInExpr"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/testExternalRef/varInExpr" xmlns:ns="com.sun.ihe.pixpdq.exc.PixPdqUnknownWhatDomainsInQueryException" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/testExternalRef/varInExpr">
            <xsd:import namespace="com.sun.ihe.pixpdq.exc.PixPdqUnknownWhatDomainsInQueryException" schemaLocation="varInExpr.xsd"/>
        </xsd:schema>
    </types>
    <message name="varInExprOperationRequest">
        <part name="part1" element="ns:inputElement"/>
    </message>
    <message name="varInExprOperationResponse">
        <part name="part1" element="ns:whatDomains"/>
    </message>
    <portType name="varInExprPortType">
        <operation name="varInExprOperation">
            <input name="input1" message="tns:varInExprOperationRequest"/>
            <output name="output1" message="tns:varInExprOperationResponse"/>
        </operation>
    </portType>
    <binding name="varInExprBinding" type="tns:varInExprPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="varInExprOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="varInExprService">
        <port name="varInExprPort" binding="tns:varInExprBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/varInExprService/varInExprPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="varInExpr">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="varInExprPortTypeRole" portType="tns:varInExprPortType"/>
    </plnk:partnerLinkType>
</definitions>

