driver-tests/bpelse/assign/AssignJbi/test/varInExpr/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.sun.ihe.pixpdq.exc.PixPdqUnknownWhatDomainsInQueryException">
  <soapenv:Body>
    <com:inputElement>testInput</com:inputElement>
  </soapenv:Body>
</soapenv:Envelope>