driver-tests/bpelse/assign/AssignJbi/test/results/varInExpr/Actual_20130318180110_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <whatDomains xmlns="com.sun.ihe.pixpdq.exc.PixPdqUnknownWhatDomainsInQueryException" xmlns:msgns="http://j2ee.netbeans.org/wsdl/testExternalRef/varInExpr">
      <domain1 xmlns:com="com.sun.ihe.pixpdq.exc.PixPdqUnknownWhatDomainsInQueryException" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">testInput</domain1>
      <domain2>Test String</domain2>
    </whatDomains>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>